spec/fixtures/files/stripe/subscription_list_requires_action.json

{
  "object": "list",
  "data": [
    {"id":"sub_GZ3sF2rBGcJJ95","object":"subscription","application_fee_percent":null,"billing_cycle_anchor":1579271062,"billing_thresholds":null,"cancel_at":null,"cancel_at_period_end":false,"canceled_at":null,"collection_method":"charge_automatically","created":1579271062,"current_period_end":1581949462,"current_period_start":1579271062,"customer":"cus_GZ3sFjWJieMfPL","days_until_due":null,"default_payment_method":null,"default_source":null,"default_tax_rates":[],"discount":null,"ended_at":null,"invoice_customer_balance_settings":{"consume_applied_balance_on_void":true},"items":{"object":"list","data":[{"id":"si_GZ3smxYW6CzCtu","object":"subscription_item","billing_thresholds":null,"created":1579271063,"metadata":{},"plan":{"id":"climate_offset_35_0_sek_monthly","object":"plan","active":true,"aggregate_usage":null,"amount":3500,"amount_decimal":"3500","billing_scheme":"per_unit","created":1578687755,"currency":"sek","interval":"month","interval_count":1,"livemode":false,"metadata":{},"nickname":null,"product":"prod_GWX4GHFryPTUnf","tiers":null,"tiers_mode":null,"transform_usage":null,"trial_period_days":null,"usage_type":"licensed"},"quantity":1,"subscription":"sub_GZ3sF2rBGcJJ95","tax_rates":[]}],"has_more":false,"total_count":1,"url":"/v1/subscription_items?subscription=sub_GZ3sF2rBGcJJ95"},"latest_invoice":{"id":"in_1G1vkIHwuhGySQCdZPmaQUnW","object":"invoice","account_country":"SE","account_name":"GoClimateNeutral.org","amount_due":3500,"amount_paid":0,"amount_remaining":3500,"application_fee_amount":null,"attempt_count":0,"attempted":true,"auto_advance":true,"billing_reason":"subscription_create","charge":null,"collection_method":"charge_automatically","created":1579271062,"currency":"sek","custom_fields":null,"customer":"cus_GZ3sFjWJieMfPL","customer_address":null,"customer_email":"8@example.com","customer_name":null,"customer_phone":null,"customer_shipping":null,"customer_tax_exempt":"none","customer_tax_ids":[],"default_payment_method":null,"default_source":null,"default_tax_rates":[],"description":"Tack för du vill vara med och stoppa klimatförändringarna!\n\nBetala här: ","discount":null,"due_date":null,"ending_balance":0,"footer":null,"hosted_invoice_url":"https://pay.stripe.com/invoice/invst_xdBsD7xOS48m7zVux1kiZyEYrS","invoice_pdf":"https://pay.stripe.com/invoice/invst_xdBsD7xOS48m7zVux1kiZyEYrS/pdf","lines":{"object":"list","data":[{"id":"sli_b5f7671cccdd10","object":"line_item","amount":3500,"currency":"sek","description":"1 × Climate Offset 35.0 sek Monthly (at 35.00 kr / month)","discountable":true,"livemode":false,"metadata":{},"period":{"end":1581949462,"start":1579271062},"plan":{"id":"climate_offset_35_0_sek_monthly","object":"plan","active":true,"aggregate_usage":null,"amount":3500,"amount_decimal":"3500","billing_scheme":"per_unit","created":1578687755,"currency":"sek","interval":"month","interval_count":1,"livemode":false,"metadata":{},"nickname":null,"product":"prod_GWX4GHFryPTUnf","tiers":null,"tiers_mode":null,"transform_usage":null,"trial_period_days":null,"usage_type":"licensed"},"proration":false,"quantity":1,"subscription":"sub_GZ3sF2rBGcJJ95","subscription_item":"si_GZ3smxYW6CzCtu","tax_amounts":[],"tax_rates":[],"type":"subscription","unique_id":"il_1G1vkIHwuhGySQCdTPU2CDpF"}],"has_more":false,"total_count":1,"url":"/v1/invoices/in_1G1vkIHwuhGySQCdZPmaQUnW/lines"},"livemode":false,"metadata":{},"next_payment_attempt":null,"number":"A647B474-0001","paid":false,"payment_intent":{"id":"pi_1G1vkIHwuhGySQCdjELmY4II","object":"payment_intent","amount":3500,"amount_capturable":0,"amount_received":0,"application":null,"application_fee_amount":null,"canceled_at":null,"cancellation_reason":null,"capture_method":"automatic","charges":{"object":"list","data":[],"has_more":false,"total_count":0,"url":"/v1/charges?payment_intent=pi_1G1vkIHwuhGySQCdjELmY4II"},"client_secret":"pi_1G1vkIHwuhGySQCdjELmY4II_secret_POwfSLbmYSiPdQBkoSfWsRYXE","confirmation_method":"automatic","created":1579271062,"currency":"sek","customer":"cus_GZ3sFjWJieMfPL","description":"Subscription creation","invoice":"in_1G1vkIHwuhGySQCdZPmaQUnW","last_payment_error":null,"livemode":false,"metadata":{},"next_action":{"type":"use_stripe_sdk","use_stripe_sdk":{"type":"stripe_3ds2_challenge","stripe_js":{"three_d_secure_2_source":"src_1G1vkJHwuhGySQCduEbD6BSh","directory_server_name":"visa","server_transaction_id":"b36d9624-ebf8-4894-87f3-a647e7fa4c66","acs_transaction_id":"cd9c80fb-4a11-4f29-a115-80a11149f256","acs_url":"https://hooks.stripe.com/3d_secure_2_test/challenge","creq":"eyJ0aHJlZURTU2VydmVyVHJhbnNJRCI6ImIzNmQ5NjI0LWViZjgtNDg5NC04N2YzLWE2NDdlN2ZhNGM2NiIsImFjc1RyYW5zSUQiOiJjZDljODBmYi00YTExLTRmMjktYTExNS04MGExMTE0OWYyNTYiLCJjaGFsbGVuZ2VXaW5kb3dTaXplIjoiMDUiLCJtZXNzYWdlVHlwZSI6IkNSZXEiLCJtZXNzYWdlVmVyc2lvbiI6IjIuMS4wIn0=","three_ds_optimizations":"k"}}},"on_behalf_of":null,"payment_method":"pm_1G1vjtHwuhGySQCdrw6x1qK3","payment_method_options":{"card":{"installments":null,"request_three_d_secure":"automatic"}},"payment_method_types":["card"],"receipt_email":null,"review":null,"setup_future_usage":"off_session","shipping":null,"source":null,"statement_descriptor":null,"statement_descriptor_suffix":null,"status":"requires_action","transfer_data":null,"transfer_group":null},"period_end":1579271062,"period_start":1579271062,"post_payment_credit_notes_amount":0,"pre_payment_credit_notes_amount":0,"receipt_number":null,"starting_balance":0,"statement_descriptor":null,"status":"open","status_transitions":{"finalized_at":1579271062,"marked_uncollectible_at":null,"paid_at":null,"voided_at":null},"subscription":"sub_GZ3sF2rBGcJJ95","subtotal":3500,"tax":null,"tax_percent":null,"total":3500,"total_tax_amounts":[],"webhooks_delivered_at":1579271064},"livemode":false,"metadata":{},"next_pending_invoice_item_invoice":null,"pending_invoice_item_interval":null,"pending_setup_intent":null,"pending_update":null,"plan":{"id":"climate_offset_35_0_sek_monthly","object":"plan","active":true,"aggregate_usage":null,"amount":3500,"amount_decimal":"3500","billing_scheme":"per_unit","created":1578687755,"currency":"sek","interval":"month","interval_count":1,"livemode":false,"metadata":{},"nickname":null,"product":"prod_GWX4GHFryPTUnf","tiers":null,"tiers_mode":null,"transform_usage":null,"trial_period_days":null,"usage_type":"licensed"},"quantity":1,"schedule":null,"start_date":1579271062,"status":"incomplete","tax_percent":null,"trial_end":null,"trial_start":null}
  ],
  "has_more": false,
  "url": "/v1/subscriptions"
}
